Autodesk.Revit.DB.DirectContext3D.VertexStream
The base class for DirectContext3D vertex streams, which are used to write vertex data into buffers.
Remarks:
For each type of vertex (e.g., Autodesk::Revit::DB::DirectContext3D::VertexPositionNormal), there is a corresponding stream type.
The process of putting vertex data into a buffer involves using a stream-buffer pair as follows
(see Autodesk::Revit::DB::DirectContext3D::VertexBuffer).
Map the vertex buffer.
Get a stream of the appropriate type from the buffer.
Add vertices of the same type to the stream. They will be written into the buffer that was used to create the stream.
Unmap the buffer.
Alternatively to using streams, it is possible to write data into a buffer using a handle to its mapped memory.
Since:
2017